/* -------------------------------------------------------------------------- */
/*                      웹 브라우저가 가지고 있는 기능 알아보기                         */
/* -------------------------------------------------------------------------- */

// log : 콘솔에만 기록
console.log('hello javascript!');

// alert : 확인만
alert('마우스 우클릭은 사용할 수 없습니다.');

// confirm : 확인 (true) / 취소 (false) 값을 받음
confirm('정말 회원 탈퇴를 하시겠습니까?');

// prompt : 사용자에게 input을 받음 (디버깅 용으로 많이 사용)
prompt('Are you tired?');

/* -------------------------------------------------------------------------- */
/*                               Code Structure                               */
/* -------------------------------------------------------------------------- */


// 한 줄 주석 (single line comment)
console.log('ECMAScript의 `문`은 어떠한 작업을 수행하는 문법 구조 및 명령을 의미합니다.');


// 세미콜론 (semicolons)
console.log('다음 줄에서 코드를 작성 할 경우, 세미콜론을 붙인 것과 동일합니다.')
console.log('하지만 세미콜론을 명시적으로 추가할 것을 권장합니다.');

/*
  여러 줄 (multi lines)
  주석 (comment)
*/

